In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('gen.csv')

In [3]:
df

      id       name  movie_id
0     16  Animation       862
1     35     Comedy       862
2  10751     Family       862
3     12  Adventure      8844
4     14    Fantasy      8844
5  10751     Family      8844

In [8]:
df.loc[df.shape[0]] = [-1, 'Krishna',0]

In [9]:
df

      id       name  movie_id
0     16  Animation       862
1     35     Comedy       862
2  10751     Family       862
3     12  Adventure      8844
4     14    Fantasy      8844
5  10751     Family      8844
6     -1    Krishna         0